templier1994/hevs-isi-watermon-hei-sensors/STM32CubeExpansion_LRWAN_V1.3.1/Projects/B-L072Z-LRWAN1/Applications/LoRa/AT_Slave/LoRaWAN/App/src/main.c
/*
 / _____)             _              | |
( (____  _____ ____ _| |_ _____  ____| |__
 \____ \| ___ |    (_   _) ___ |/ ___)  _ \
 _____) ) ____| | | || |_| ____( (___| | | |
(______/|_____)_|_|_| \__)_____)\____)_| |_|
    (C)2013 Semtech
Description: Generic lora driver implementation
License: Revised BSD License, see LICENSE.TXT file include in the project
Maintainer: Miguel Luis, Gregory Cristian and Wael Guibene
*/
/**
  ******************************************************************************
  * @file    main.c
  * @author  MCD Application Team
  * @brief   this is the main!
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "hw.h"
#include "low_power_manager.h"
#include "timeServer.h"
#include "version.h"
#include "command.h"
#include "at.h"
#include "lora.h"
#include "stdio.h"
#include "stm32l0xx_hal.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

#define LORAWAN_MAX_BAT   254

/**
 * @brief LoRaWAN Adaptive Data Rate
 * @note Please note that when ADR is enabled the end-device should be static
 */
#define LORAWAN_ADR_ON                              1

/**
 * When fast wake up is enabled, the mcu wakes up in ~20us and
 * does not wait for the VREFINT to be settled. THis is ok for
 * most of the case except when adc must be used in this case before
 * starting the adc, you must make sure VREFINT is settled
 */
#define ENABLE_FAST_WAKEUP

/* Private macro -------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

/* call back when LoRa has received a frame*/
static void LoraRxData(lora_AppData_t *AppData);
/* call back when LoRa endNode has just joined*/
static void LORA_HasJoined(void);
/* call back when LoRa endNode has just switch the class*/
static void LORA_ConfirmClass(DeviceClass_t Class);

/* call back when server needs endNode to send a frame*/
static void LORA_TxNeeded(void);

/* callback to get the battery level in % of full charge (254 full charge, 0 no charge)*/
static uint8_t LORA_GetBatteryLevel(void);

/* tx timer callback function*/
static void LoraMacProcessNotify(void);

static void LORA_McpsDataConfirm(void);

/* Private variables ---------------------------------------------------------*/
/* load call backs*/
static LoRaMainCallback_t LoRaMainCallbacks = { LORA_GetBatteryLevel,
                                                HW_GetTemperatureLevel,
                                                HW_GetUniqueId,
                                                HW_GetRandomSeed,
                                                LoraRxData,
                                                LORA_HasJoined,
                                                LORA_ConfirmClass,
                                                LORA_TxNeeded,
                                                LoraMacProcessNotify,
                                                LORA_McpsDataConfirm
                                              };
LoraFlagStatus LoraMacProcessRequest = LORA_RESET;
/**
 * Initialises the Lora Parameters
 */

#define LORAWAN_APP_PORT	 								1
#define LORAWAN_APP_DATA_BUFF_SIZE                          64
#define LORAWAN_DEFAULT_CONFIRM_MSG_STATE           		LORAWAN_UNCONFIRMED_MSG
#define LORAWAN_DEFAULT_CLASS                       		CLASS_A
#define LORAWAN_DEFAULT_DATA_RATE 							DR_0
#define LORAWAN_ADR_STATE 									LORAWAN_ADR_ON
#define APP_TX_DUTYCYCLE                            		120000 //2m

static LoRaParam_t LoRaParamInit = {LORAWAN_ADR_STATE, LORAWAN_DEFAULT_DATA_RATE, LORAWAN_PUBLIC_NETWORK };

static uint8_t AppDataBuff[LORAWAN_APP_DATA_BUFF_SIZE];
lora_AppData_t AppData = { AppDataBuff,  0, 0 };
static void sendMsg(void *context);

/*Timer*/
static TimerEvent_t TxTimer;
/* tx timer callback function*/
static void OnTxTimerEvent(void *context);
/* call back when server needs endNode to send a frame*/
static void LORA_TxNeeded(void);
/* start the tx process*/
static void LoraStartTx(TxEventType_t EventType);
LoraFlagStatus AppProcessRequest = LORA_RESET;

/* Private functions ---------------------------------------------------------*/

/* UART ultrasound sensors*/
UART_HandleTypeDef huart1;

static void MX_USART1_UART_Init(void);

#define rxBuf_size 		5 	//5
uint8_t rxBuf[rxBuf_size];
HAL_StatusTypeDef UART1status;
uint8_t toto = 0;

/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void)
{
  /* STM32 HAL library initialization*/
  HAL_Init();

  /* Configure the system clock*/
  SystemClock_Config();

  /* Configure the hardware*/
  HW_Init();


  /*pims, enable ultrasound sensor */
	/* enable the relay */
	 GPIO_InitTypeDef x;
	 x.Pin   = GPIO_PIN_11;
	 x.Mode  = GPIO_MODE_OUTPUT_PP;

	 HAL_GPIO_Init(GPIOA, &x);
	 HAL_GPIO_WritePin(GPIOA, x.Pin, 1);
	 /*pims*/


  /* Configure Debug mode */
//  DBG_Init();


  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
	Error_Handler();
  }
  //USARTx_TX_GPIO_CLK_ENABLE();
  //USARTx_RX_GPIO_CLK_ENABLE();

  MX_USART1_UART_Init();



  PRINTF("end MX_USART1_UART_Init \n\r");


  CMD_Init();
  /*Disable standby mode*/
//  LPM_SetOffMode(LPM_APPLI_Id, LPM_Disable);

  PPRINTF("ATtention command interface\n\r");

  /* Configure the Lora Stack*/
  /*LORA_Init(&LoRaMainCallbacks, &LoRaParamInit);

  Derectly at the intitialisation join LoRa
  PRINTF("LORA_JOIN()... wait 10s \n\r");
  LORA_Join(); //this function take ~10s,
  HAL_Delay(12000);
  PRINTF("end delay initialization \n\r");

  LoraStartTx(TX_ON_TIMER) ;
  */
  /* main loop*/
  while (1)
  {
	  toto++;
	  //do it juste one time
	  while(rxBuf[4]==0){
		  UART1status = HAL_UART_Receive(&huart1, (uint8_t *)rxBuf, rxBuf_size, HAL_MAX_DELAY); //HAL_MAX_DELAY
		  PRINTF("%s",&rxBuf);
	  }

	  if (AppProcessRequest == LORA_SET)
	  {
		/*get uart msg (ultrasonic sensor)*/

		/*get i2c msg (pressure sensor)*/

		/*reset notification flag*/
		AppProcessRequest = LORA_RESET;
		/*SendMsg*/
		sendMsg(NULL);
	  }

    /* Handle UART commands */
    CMD_Process();

    if (LoraMacProcessRequest == LORA_SET)
    {
      /*reset notification flag*/
      LoraMacProcessRequest = LORA_RESET;
      LoRaMacProcess();
    }

  }
}


static void LoraRxData(lora_AppData_t *AppData)
{
  set_at_receive(AppData->Port, AppData->Buff, AppData->BuffSize);
}

#ifdef  USE_FULL_ASSERT
void assert_failed(uint8_t *file, uint32_t line)
{
  Error_Handler();
}
#endif

void LoraMacProcessNotify(void)
{
  LoraMacProcessRequest = LORA_SET;
}

static void LORA_HasJoined(void)
{
  PRINTF("JOINED\n\r");
}

static void LORA_ConfirmClass(DeviceClass_t Class)
{
  PRINTF("switch to class %c done\n\r", "ABC"[Class]);
}


/**
  * @brief This function return the battery level
  * @param none
  * @retval the battery level  1 (very low) to 254 (fully charged)
  */
uint8_t LORA_GetBatteryLevel(void)
{
  uint16_t batteryLevelmV;
  uint8_t batteryLevel = 0;

  batteryLevelmV = HW_GetBatteryLevel();


  /* Convert batterey level from mV to linea scale: 1 (very low) to 254 (fully charged) */
  if (batteryLevelmV > VDD_BAT)
  {
    batteryLevel = LORAWAN_MAX_BAT;
  }
  else if (batteryLevelmV < VDD_MIN)
  {
    batteryLevel = 0;
  }
  else
  {
    batteryLevel = (((uint32_t)(batteryLevelmV - VDD_MIN) * LORAWAN_MAX_BAT) / (VDD_BAT - VDD_MIN));
  }

  return batteryLevel;
}

static void LORA_McpsDataConfirm(void)
{
  PRINTF("Network Server \"ack\" an uplink data confirmed message transmission\n\r");
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

/************************ LoRa Part****/
/**
 * Send a message to TTN
 */
static void sendMsg(void *context){
	PRINTF("Main.c : sendMsg() \n\r");

	/*Variables to send*/
	int16_t snowHeight = 12;
	uint8_t batteryLevel;

	 if (LORA_JoinStatus() != LORA_SET)
	  {
	    /*Not joined, try again later*/
		// PRINTF("re-join\n\r");
	    LORA_Join();
	    return;
	  }

	batteryLevel = LORA_GetBatteryLevel();

	AppData.Port = LORAWAN_APP_PORT;
	uint32_t i = 0;

	AppData.Buff[i++] = batteryLevel;
	AppData.Buff[i++] = snowHeight;

	AppData.BuffSize = i;

	LORA_send(&AppData, LORAWAN_DEFAULT_CONFIRM_MSG_STATE);

}

static void OnTxTimerEvent(void *context)
{
	PRINTF("OnTxTimerEvent \n\r");
  /*Wait for next tx slot*/
  TimerStart(&TxTimer);

  AppProcessRequest = LORA_SET;
}

static void LoraStartTx(TxEventType_t EventType)
{
	PRINTF("LoraStartTx \n\r");

  if (EventType == TX_ON_TIMER)
  {
    /* send everytime timer elapses */
    TimerInit(&TxTimer, OnTxTimerEvent);
    TimerSetValue(&TxTimer,  APP_TX_DUTYCYCLE);
    OnTxTimerEvent(NULL);
  }

}
static void LORA_TxNeeded(void)
{
	PRINTF("LORA_TxNeeded \n\r");

  AppData.BuffSize = 0;
  AppData.Port = LORAWAN_APP_PORT;

  LORA_send(&AppData, LORAWAN_UNCONFIRMED_MSG);
}

/************************ End LoRa Part****/

/************************ Uart 1 Part : ultrasound sensor****/
static void MX_USART1_UART_Init(void)
{

  huart1.Instance = USART1;
  huart1.Init.BaudRate = 9600;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_RXINVERT_INIT;
  huart1.AdvancedInit.RxPinLevelInvert = UART_ADVFEATURE_RXINV_ENABLE;
  if (HAL_UART_Init(&huart1) != HAL_OK) // breakpoint here! there is a probleme. this is not 2 times the same function!!
  {
    Error_Handler();
  }
}

